{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [{
            "id": 0,
            "special": true,
            "content": "[PAD]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false
        }
    ],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "WhitespaceSplit"
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": null,
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "vocab": {
            "[PAD]": 0,
            "C": 1,
            "c": 2,
            "1": 3,
            "(": 4,
            ">": 5,
            "2": 6,
            "s": 7,
            "N": 8,
            "=": 9,
            ")": 10,
            "n": 11,
            "[C@H]": 12,
            "O": 13,
            "[C@@H]": 14,
            "S": 15,
            "[nH]": 16,
            "3": 17,
            "Cl": 18,
            "Br": 19,
            "/": 20,
            "\\": 21,
            "[C@]": 22,
            "o": 23,
            "[C@@]": 24,
            "4": 25,
            "5": 26,
            "6": 27,
            "7": 28,
            "[n+]": 29,
            ".": 30,
            "[Br-]": 31,
            "I": 32,
            "F": 33,
            "[O-]": 34,
            "8": 35,
            "#": 36,
            "[N+]": 37,
            "P": 38,
            "9": 39,
            "[Na+]": 40,
            "[Cl-]": 41,
            "%10": 42,
            "%11": 43,
            "%12": 44,
            "%13": 45,
            "%14": 46,
            "%15": 47,
            "%16": 48,
            "%17": 49,
            "%18": 50,
            "%19": 51,
            "%20": 52,
            "%21": 53,
            "%22": 54,
            "%23": 55,
            "[I-]": 56,
            "[Si]": 57,
            "[N-]": 58,
            "[18F]": 59,
            "B": 60,
            "[S+]": 61,
            "[2H]": 62,
            "[P+]": 63,
            "[125I]": 64,
            "[PH]": 65,
            "[n-]": 66,
            "[B-]": 67,
            "[O]": 68,
            "[o+]": 69,
            "[N@@+]": 70,
            "[N@+]": 71,
            "[se]": 72,
            "[Se]": 73,
            "[s+]": 74,
            "[Li+]": 75,
            "[P@]": 76,
            "[P@@]": 77,
            "[3H]": 78,
            "[K+]": 79,
            "[OH-]": 80,
            "[S@+]": 81,
            "[11CH3]": 82,
            "[Cl+3]": 83,
            "[S-]": 84,
            "[C+]": 85,
            "[C-]": 86,
            "[Zn+2]": 87,
            "[Ca+2]": 88,
            "[Mg+2]": 89,
            "[S@@+]": 90,
            "[As]": 91,
            "[P-]": 92,
            "[OOV]": 93,
            "cc": 94,
            "CC": 95,
            "O)": 96,
            "C(": 97,
            "=O)": 98,
            "c1": 99,
            "c(": 100,
            "c2": 101,
            "C)": 102,
            "C(=O)": 103,
            "c1cc": 104,
            "c3": 105,
            "c2cc": 106,
            ")cc": 107,
            "(C)": 108,
            "(=O)": 109,
            "C(=O)N": 110,
            "CCCC": 111,
            "c1ccc(": 112,
            "CN": 113,
            "c3cc": 114,
            "CO": 115,
            "F)": 116,
            "2)": 117,
            "[C@H](": 118,
            "c1cccc": 119,
            "C1": 120,
            "NC(=O)": 121,
            "[C@@H](": 122,
            "c2cccc": 123,
            "cn": 124,
            "N)": 125,
            ")cc1": 126,
            "c4": 127,
            "=C(": 128,
            "CCN": 129,
            "3)": 130,
            "c2ccccc2": 131,
            "c2ccc(": 132,
            "c1ccccc1": 133,
            "C2": 134,
            "n1": 135,
            "nc(": 136,
            "C(C)": 137,
            "c3cccc": 138,
            "CC1": 139,
            "CC(=O)": 140,
            "CCO": 141,
            "S(=O)": 142,
            "=C": 143,
            "O=C(": 144,
            "S(=O)(=O)": 145,
            "(F)": 146,
            "CCN(": 147,
            "Cl)": 148,
            "OC)": 149,
            "c3ccccc3": 150,
            "cccc": 151,
            "CC(C)": 152,
            "c1cc(": 153,
            "n2": 154,
            "c2c(": 155,
            "cc1": 156,
            "[C@H]1": 157,
            "c3ccc(": 158,
            "CCCN": 159,
            "C(F)": 160,
            "/C": 161,
            "(C": 162,
            "OC": 163,
            "c1n": 164,
            "[C@@H]1": 165,
            "C(F)(F)": 166,
            "CCC": 167,
            "cc(": 168,
            "CC(=O)N": 169,
            "F)cc": 170,
            "c2ccccc2)": 171,
            "c2)": 172,
            "c(=O)": 173,
            "(O)": 174,
            "Cc1ccc(": 175,
            "Cl)cc": 176,
            "c2n": 177,
            "4)": 178,
            "C(=O)N[C@@H](": 179,
            "=O": 180,
            ")N": 181,
            "=C/": 182,
            "2)cc1": 183,
            "COc1ccc(": 184,
            "C(=O)O)": 185,
            "c1cccc(": 186,
            "NC(=O)[C@H](": 187,
            "=N": 188,
            "[C@H]2": 189,
            "c2cc(": 190,
            "[C@@H]2": 191,
            "c(>": 192,
            "c1)": 193,
            "c1ccccc1)": 194,
            "C3": 195,
            "C(=O)O": 196,
            "Cc1": 197,
            "c4cccc": 198,
            "CCC(": 199,
            "O=": 200,
            "c5": 201,
            "CC(": 202,
            "[C@H](O)": 203,
            "N2": 204,
            "CC2)": 205,
            "C(C)(C)": 206,
            "c3c(": 207,
            "[C@@H](O)": 208,
            "CO)": 209,
            "[C@@H](C)": 210,
            "/C=C/": 211,
            "ccc(": 212,
            "c3ccccc3)": 213,
            "[C@H](C)": 214,
            "nc(>": 215,
            "C(=": 216,
            "c3)": 217,
            "c2c1": 218,
            "N1": 219,
            "CC2": 220,
            "cs": 221,
            "(=O)[O-]": 222,
            "1)": 223,
            "[N+](=O)[O-]": 224,
            "CS": 225,
            "nn": 226,
            "CN1": 227,
            "O=C(N": 228,
            "3)cc": 229,
            "c(C)": 230,
            "C#": 231,
            "c4ccccc4": 232,
            "N)=O)": 233,
            "C(F)(F)F)": 234,
            "cc2": 235,
            "CCCCCCCC": 236,
            "c[nH]": 237,
            "COC(=O)": 238,
            "c12": 239,
            "CC)": 240,
            "C(C)C)": 241,
            "O=C(O)": 242,
            "Cc1cc": 243,
            "CN(": 244,
            "[C@H]3": 245,
            "2)c1": 246,
            "CNC(=O)": 247,
            "[C@@H]3": 248,
            "c(O)": 249,
            "CC3)": 250,
            "C[C@H](": 251,
            "(>": 252,
            "C(=O)N1": 253,
            "c(N": 254,
            "/C(": 255,
            "c3n": 256,
            "nc(N": 257,
            "c(OC)": 258,
            "C2)": 259,
            "CN(C)": 260,
            "/N": 261,
            "S(=O)(=O)N": 262,
            "C(C)=O)": 263,
            "Cn1": 264,
            "Cl)cc1": 265,
            "COc1cc(": 266,
            "OC(=O)": 267,
            "C=": 268,
            "c2cccc(": 269,
            "F)cc1": 270,
            "CC(C)C)": 271,
            "n3": 272,
            "c1ccc2c(": 273,
            "c1ccc(>": 274,
            "co": 275,
            "(C)C)": 276,
            "c1cc2": 277,
            "nc2": 278,
            "C(=N)": 279,
            "c4ccc(": 280,
            "2)CC1": 281,
            "CC[C@]": 282,
            "c2cn": 283,
            "O=C1": 284,
            "CCN1": 285,
            "c(Cl)": 286,
            "CCOC(=O)": 287,
            "C1=O": 288,
            "Cc1ccccc1)": 289,
            "Cc1cc(": 290,
            "=C\\": 291,
            "cc3": 292,
            "CC(C)(C)": 293,
            "NC(=O)[C@@H](": 294,
            "c1cn": 295,
            "c3cc(": 296,
            "CN2": 297,
            "c2ccc(Cl)cc": 298,
            "nc1": 299,
            "Cc1ccccc1": 300,
            "Br)": 301,
            "P(=O)": 302,
            "4)cc": 303,
            "C[C@@H](": 304,
            "N(": 305,
            ".Cl": 306,
            "cc2)": 307,
            "C(=O)N2": 308,
            "C(C)(C)C)": 309,
            "O)cc1": 310,
            "C3)": 311,
            "OCC": 312,
            "[O-])": 313,
            "CC(=O)O)": 314,
            "C(F)(F)F)cc": 315,
            ")N1": 316,
            "Cc1n": 317,
            "C(N)=O)": 318,
            "C[C@H]1": 319,
            "CCN(C(=O)": 320,
            "[N+](=O)[O-])": 321,
            "c23)": 322,
            "c1O": 323,
            "NC(=O)N": 324,
            "5)": 325,
            "O[C@H](": 326,
            "CCCCC1": 327,
            "cc(>": 328,
            "ncn": 329,
            "C(=O)N[C@H](": 330,
            "c1ccc2c(c1)": 331,
            "n(": 332,
            "[C@@]2": 333,
            "3)cc1": 334,
            "c1c(": 335,
            "c2ccc(F)cc": 336,
            "C(=N)N)": 337,
            "(=O)=O)": 338,
            "OCO": 339,
            "c1ccc(Cl)cc1": 340,
            "=C(N)": 341,
            "Cc2ccccc2)": 342,
            "C#N)": 343,
            "C(O)": 344,
            "c4cc": 345,
            "[C@]1": 346,
            "CC1)": 347,
            "N#": 348,
            "CCCCN)": 349,
            "c2)cc1": 350,
            "c(=O)[nH]": 351,
            "C[C@@H]1": 352,
            "CC2)cc1": 353,
            "c2nc(": 354,
            "n2)": 355,
            "CC3": 356,
            "c1nc(": 357,
            ")cc2": 358,
            "CCCN1": 359,
            "s1": 360,
            "o1": 361,
            "C(F)(F)F": 362,
            "CC[C@H](": 363,
            "NS(=O)(=O)": 364,
            "C2=O)": 365,
            "c2ccc(>": 366,
            "n2)cc1": 367,
            "[C@@]1": 368,
            "cn1": 369,
            "c21": 370,
            "c(F)": 371,
            "n(C)": 372,
            "CCCNC(=N)N)": 373,
            "cc3)": 374,
            "c1cccc2": 375,
            "c2[nH]": 376,
            "c1=O": 377,
            "N3": 378,
            "CCC1": 379,
            "CCN(C": 380,
            "CCNC(=O)": 381,
            "C(=S": 382,
            "c4ccccc4)": 383,
            "c12)": 384,
            "nc3": 385,
            "c4)": 386,
            "P(=O)(O)": 387,
            "(C)C": 388,
            "=C(C)": 389,
            "(CC": 390,
            "[C@@H]4": 391,
            "O[C@@H](": 392,
            "c3cccc(": 393,
            "Cc1cccc(": 394,
            "([O-])": 395,
            ".O=C(O)": 396,
            "Br)cc": 397,
            "c2ccc3c(": 398,
            "c1>": 399,
            "c2ccccc2)cc1": 400,
            "c2ccccc21": 401,
            "=N/": 402,
            "C4": 403,
            "c(N)": 404,
            "CCn1": 405,
            "CCC(=O)O)": 406,
            "c2cc3": 407,
            "CC(=O)O": 408,
            "COc1ccccc1": 409,
            "=C2": 410,
            "n(>": 411,
            "COc1cccc(": 412,
            "CCC2": 413,
            "=C1": 414,
            "OC(C)=O)": 415,
            "n3)": 416,
            "COc1ccc(>": 417,
            "c1ccc(F)cc1": 418,
            "c3ccc(Cl)cc": 419,
            "S(C)": 420,
            "c2=O)": 421,
            "(C)CC": 422,
            "[C@H]4": 423,
            ")cc(": 424,
            "n1)": 425,
            "c3ccc(F)cc": 426,
            "c4c(": 427,
            "C(N)": 428,
            "c3cn": 429,
            "c2ccc(O)": 430,
            "CCS": 431,
            "c5cccc": 432,
            "OC)c(OC)": 433,
            "CC(O)": 434,
            "=C(\\": 435,
            "Nc1n": 436,
            "c1ccc(O": 437,
            "c2n1": 438,
            "S)": 439,
            "CCC(=O)N": 440,
            "c2ccc3c(c2)": 441,
            "CCCC1": 442,
            "Cc1ccc(>": 443,
            "ncc": 444,
            "=N\\": 445,
            "c1ccc(N": 446,
            "C)cc1": 447,
            "CC4)": 448,
            "Cc1cn": 449,
            "CCCO": 450,
            "c2ccc(Cl)cc2)": 451,
            "c1OC": 452,
            "CCN2": 453,
            "c2cccn": 454,
            "3CCCC": 455,
            "CN(C": 456,
            "[C@]2": 457,
            "C#N": 458,
            "Cc1c[nH]": 459,
            "CCN(CC)": 460,
            "c6": 461,
            "C(=S)N": 462,
            "/N=C/": 463,
            ")cc2)": 464,
            "N(C)": 465,
            "COc1cc2": 466,
            "C2)cc1": 467,
            "S(C)(=O)=O)": 468,
            "C2CCCC": 469,
            "O1": 470,
            "C[C@H]2": 471,
            "c2nc(>": 472,
            "C(=O)N(": 473,
            "Cn2": 474,
            "CC(N)=O)": 475,
            "C[C@@H]2": 476,
            "OC(": 477,
            "c1cc(>": 478,
            "Cl)c(Cl)": 479,
            "CC(=O)N1": 480,
            "[C@@]3": 481,
            "c2cc(>": 482,
            "O)cc1)": 483,
            "n(C": 484,
            "O[C@H](CO)": 485,
            "/C=C\\": 486,
            "c2ccccc12)": 487,
            "3)cc2": 488,
            "CC(C": 489,
            "C1)": 490,
            "cc(C)": 491,
            ".O=C(O)C(F)(F)F": 492,
            "[C@@H]1O": 493,
            "c2)c1": 494,
            "nn1": 495,
            "CCCN(": 496,
            "c(C(=O)N": 497,
            "CCCN2": 498,
            "C=C": 499,
            "C[C@H](O)": 500,
            "[C@@H](O)[C@H](O)": 501,
            "c2ccc(F)cc2)": 502,
            "cn2": 503,
            "c(C)c1": 504,
            "C(C)C": 505,
            "c2ncn": 506,
            "c2ccccc12": 507,
            "CC1(C)": 508,
            "CS(=O)(=O)": 509,
            "COc1cc": 510,
            "nc(C)": 511,
            "n4": 512,
            "C(=O)OC": 513,
            "c2cc1": 514,
            "CCC(N)=O)": 515,
            "c5ccccc5": 516,
            "C(=O)N[C@@H](CC(C)C)": 517,
            "c34)": 518,
            "C(=O)[C@H](": 519,
            "c3ccccc23)": 520,
            "CCN(C)": 521,
            "C[C@@H](O)": 522,
            "[C@H]1O": 523,
            "CC(=O)N[C@@H](": 524,
            "cnc1": 525,
            "c2c[nH]": 526,
            "(N)": 527,
            "Cc2ccc(": 528,
            "O)cc": 529,
            "c2cccc3": 530,
            "cs1": 531,
            "ncc1": 532,
            "no": 533,
            "OCCO": 534,
            "S(=O)(=O)N2": 535,
            "c3ccc(F)cc3)": 536,
            "#N)": 537,
            "N=C(N)": 538,
            "C(=O)N[C@@H](CCCCN)": 539,
            "N=C(": 540,
            "CCOCC2)": 541,
            "c2s": 542,
            "Cc1cc(C)": 543,
            "c4cc(": 544,
            "[C@@H](O": 545,
            "c(O": 546,
            "c1nc(>": 547,
            "CCC[C@H]1": 548,
            "C(=O)OC)": 549,
            "c3[nH]": 550,
            "Cl)c1": 551,
            "c(cc1": 552,
            "CCCC(=O)": 553,
            ".[Na+]": 554,
            "nc2c1": 555,
            "/C(=C\\": 556,
            "cccn": 557,
            "O=S(=O)": 558,
            "CC[C@H](C)": 559,
            "CN(C(=O)": 560,
            ")ccc1": 561,
            "C(=O)N[C@@H](CCCNC(=N)N)": 562,
            "Br)cc1": 563,
            "c3cccn": 564,
            "C(=O)NC": 565,
            "c3ccc(Cl)cc3)": 566,
            "NC(=O)CNC(=O)": 567,
            "c2ccc(C)": 568,
            "O=c1": 569,
            "3)cc2)": 570,
            "[C@@H]5": 571,
            "N(C)C)": 572,
            "nc(N)": 573,
            "c2ccc(O": 574,
            "3CCO": 575,
            "NC": 576,
            "CC[C@@H](": 577,
            "CCCCC": 578,
            "C1CCCCC1": 579,
            "(C)(": 580,
            "Cc1ccc(O)cc1)": 581,
            "CCOc1ccc(": 582,
            "n[nH]": 583,
            "[C@@H](C)O)": 584,
            "cccc2": 585,
            "NC(=O)[C@H](CC(C)C)": 586,
            "CCOCC1": 587,
            "c2o": 588,
            "[C@]12": 589,
            "NC(=O)[C@@H]1": 590,
            "3C)": 591,
            "CCO)": 592,
            "C(N)=O": 593,
            "CC[C@]2": 594,
            "Cc1c[nH]c2ccccc12)": 595,
            "CC[C@H]2": 596,
            "C(=O)N[C@@H](C)": 597,
            "c2ccc(Cl)cc2": 598,
            "=C(N)N)": 599,
            "Cc1c(": 600,
            "4(C)": 601,
            "/C=C": 602,
            "SCC(=O)N": 603,
            "C3=O)": 604,
            "C2=O": 605,
            "C(F)(F)F)cc1": 606,
            "/C(=C/": 607,
            ")cc3)": 608,
            "C=C(": 609,
            "(O": 610,
            "c2)CC1": 611,
            "CN1C(=O)": 612,
            "C=C1": 613,
            "(C(F)(F)F)": 614,
            "C(=O)N[C@@H](Cc1ccccc1)": 615,
            "/C(=N\\": 616,
            "CC2)c1": 617,
            "ccc3": 618,
            "c3ccc(>": 619,
            "cccc1": 620,
            "Cl)c(": 621,
            "cc2)cc1": 622,
            "CN1CCN(": 623,
            "c2nc(N": 624,
            "c2nc3ccccc3": 625,
            "c1cccc(>": 626,
            "c2cc(Cl)cc": 627,
            "CCC3": 628,
            "c2c(C)": 629,
            "CCCN=C(N)N)": 630,
            "OC)c1OC": 631,
            "[n+]1": 632,
            "NC1": 633,
            "NC(=O)[C@@H](N)": 634,
            "cc4": 635,
            "[C@]3": 636,
            "C(=O)N(C)": 637,
            "c2cccc(Cl)": 638,
            "c23)cc1": 639,
            "N(C": 640,
            "c2ccn": 641,
            "C2=N": 642,
            "CC4": 643,
            "[N+](=O)[O-])cc1": 644,
            "C2(": 645,
            "[N+]([O-])": 646,
            "CCC(C)": 647,
            "c3cc4": 648,
            "C[C@@H]3": 649,
            "c2ccco": 650,
            "CCOCCO": 651,
            "Cl.": 652,
            "4)cc3)": 653,
            "CCCC2": 654,
            "/C=C(\\": 655,
            "c1s": 656,
            "C[C@H]3": 657,
            "CN3": 658,
            "(Cl)": 659,
            "/C=N/": 660,
            "NC(=O)[C@H](C)": 661,
            "n1>": 662,
            "C2=O)cc1": 663,
            "c2cccs": 664,
            "NC(=O)O": 665,
            "(F)(F)": 666,
            "O=S(=O)(": 667,
            "CSc1n": 668,
            "N4": 669,
            "n2cn": 670,
            "[C@@]2(C)": 671,
            "S(N)": 672,
            "c3ccc4c(": 673,
            "C1(": 674,
            "c2ccc(O)cc2)": 675,
            "Cc2ccccc2": 676,
            "C1CCN(": 677,
            "2)C1": 678,
            "O=[N+]([O-])": 679,
            "c2ncc": 680,
            "c2c(c1)": 681,
            "c(NC(=O)": 682,
            "/C(C)": 683,
            "P(=O)(O)O": 684,
            "c1ccc(NC(=O)": 685,
            "c2>": 686,
            "CCCCC2)": 687,
            "C1=": 688,
            "N1CCN(": 689,
            "C1=C(": 690,
            "C(=N)N": 691,
            "c1c(C)": 692,
            "S(N)(=O)=O)": 693,
            "CC[C@H]1": 694,
            "n2)c1": 695,
            "CC[C@]3": 696,
            "nn2": 697,
            "c3ccc(O)": 698,
            "c2ccc(OC)": 699,
            "c1ccc(N2": 700,
            "c5ccc(": 701,
            "cc(O)": 702,
            "C(=O)N1CCC[C@H]1": 703,
            "c2c(>": 704,
            "CCCNC(=O)": 705,
            "co1": 706,
            "C3CCCC": 707,
            "c1C": 708,
            "CCCCCCCCCCCC": 709,
            "(CO)": 710,
            "NC(C)=O)": 711,
            "c1c[nH]": 712,
            "[C@H](O": 713,
            "c(OC)c1": 714,
            "c2cs": 715,
            "ccc2": 716,
            "c4cn": 717,
            "C1=O)": 718,
            "c(C(=O)O)": 719,
            "CC[C@@H]1": 720,
            "cn1)": 721,
            "c2ccccc2)CC1": 722,
            "c1nc(N": 723,
            "c3ccc(C)": 724,
            "C[C@@H](C)": 725,
            "[C@H]2O)": 726,
            "Cc3ccccc3)": 727,
            "c3c2": 728,
            "/C=C2": 729,
            "[N+](=O)[O-])cc": 730,
            "CCCn1": 731,
            "nc12": 732,
            "=S)": 733,
            "O2)": 734,
            "5)cc": 735,
            "s2)": 736,
            "=N/N": 737,
            "c1c(O)": 738,
            "CC3)cc": 739,
            "NC1=O": 740,
            "(C(=O)N": 741,
            "CCS(=O)(=O)": 742,
            "c1ccc(Br)cc1": 743,
            "CCc1n": 744,
            "C(=O)[C@@H](": 745,
            "NC(=O)[C@H](CCCCN)": 746,
            "c2ccccc2c1": 747,
            "3CCOCC3)": 748,
            "NC(=O)[C@H](CCCNC(=N)N)": 749,
            "[nH]1": 750,
            "c2nnc(": 751,
            "c2ccccc2)c1": 752,
            "c3ccc4c(c3)": 753,
            "c3ccn": 754,
            "Cc1cc2": 755,
            "C2CC2)": 756,
            "C(=O)O)cc1": 757,
            ">2": 758,
            "(C#N)": 759,
            "[nH]c(=O)": 760,
            "c3ccc(O": 761,
            "C12": 762,
            "NC(=O)[C@H](CO)": 763,
            "C4)": 764,
            "s1)": 765,
            "c1cccnc1": 766,
            "CCc1ccc(": 767,
            "C2=C(": 768,
            "NC(": 769,
            "C(=O)N3": 770,
            "F)c(F)": 771,
            "[C@@H]2O": 772,
            "CCCCO": 773,
            "c3ccccc3)cc": 774,
            "CC[C@H](C)[C@H](": 775,
            "[C@@]4": 776,
            "[C@H]5": 777,
            "C(=O)C(": 778,
            "CCCCN": 779,
            "O[C@H](CO)[C@@H](O)[C@H](O)": 780,
            "CCOCC": 781,
            "CC(C)C[C@H](": 782,
            "c2c(=O)": 783,
            "C(=O)NCC": 784,
            "ccc1": 785,
            "n2cc": 786,
            "6)": 787,
            "c2ccc3ccccc3": 788,
            "c3)cc": 789,
            "CC(=O)N2": 790,
            "c3ccco": 791,
            "N2CCN(": 792,
            "C(=O)N[C@@H](CO)": 793,
            "[N+](C)": 794,
            "C=C(C)": 795,
            "c1cc(Cl)cc": 796,
            "NC(=O)[C@H](C": 797,
            "c2ccc(N": 798,
            "C(C)=O": 799,
            "c3cc(Cl)cc": 800,
            "O2": 801,
            "(O)(": 802,
            "C(=O)/C=C/": 803,
            "c3ncn": 804,
            "CCCC(": 805,
            "c2cc(C)": 806,
            "NC(=O)[C@H](Cc1ccccc1)": 807,
            "no1": 808,
            "/C1": 809,
            "C(=O)NC(": 810,
            "c1ccc(Cl)cc1)": 811,
            "O)c(O)": 812,
            "SC": 813,
            "c1ccncc1": 814,
            "c2cc(O)": 815,
            "c3cccc4": 816,
            "P(=O)(O)O)": 817,
            "COc1ccc2c(c1)": 818,
            "c(=O)n2": 819,
            "[C@@]12": 820,
            "c2)n1": 821,
            "c4n": 822,
            "C(=O)N(C": 823,
            "C2CCCCC2)": 824,
            "[C@@]1(C)": 825,
            "Cc1cccc": 826,
            "c3o": 827,
            "c2=O)cc1": 828,
            "O=C1N": 829,
            "c2ccc(F)cc2": 830,
            "C1CC1": 831,
            "NC(=O)C(": 832,
            "C(=O)N[C@@H](CCC(=O)O)": 833,
            "OC)c(OC)c(OC)": 834,
            "ncc2": 835,
            "c1ccc([N+](=O)[O-])cc1": 836,
            "cs3)": 837,
            "Cc1nc(": 838,
            "c1ncc": 839,
            "CCN1C(=O)": 840,
            "(C)(O)": 841,
            "OC)cc1": 842,
            "P(=O)(": 843,
            "NC(=O)OC": 844,
            "CCc1ccccc1": 845,
            "c1nc2ccccc2": 846,
            "c32)": 847,
            "c2c(O)": 848,
            "c2cccc(F)": 849,
            "CN)": 850,
            "/N=C(\\": 851,
            "S1": 852,
            "c1)N": 853,
            "cccc3": 854,
            "C(C)(C)C": 855,
            "Nc1nc(": 856,
            "c(Br)": 857,
            "(=O)=O": 858,
            "O=C(/C=C/": 859,
            "=C(/": 860,
            "c3cccc(Cl)": 861,
            ")ccc1O": 862,
            "c4ccc(F)cc": 863,
            "c([N+](=O)[O-])": 864,
            "c(>c2ccccc2)": 865,
            "=C1\\": 866,
            "CC(C)(C)O": 867,
            "=CC(=O)": 868,
            ".[Br-]": 869,
            "CCCCN1": 870,
            "/C=C(\\C)": 871,
            "cn2)": 872,
            "CC(CC(C": 873,
            "OC1": 874,
            "CC(=O)N(": 875,
            "CCCCC1)": 876,
            "N[C@@H](": 877,
            "c(Cl)c1": 878,
            "c2cc3c(": 879,
            "c3ccccn3)": 880,
            "OCO3)": 881,
            "4)CC3)": 882,
            "c3ccco3)": 883,
            "[C@]1(C)": 884,
            "c2ccc(N3": 885,
            "/C=C2\\": 886,
            "[C@@]5": 887,
            "s2)cc1": 888,
            "[C@@](C)(": 889,
            "c2c[nH]c3ccccc23)": 890,
            ")cc(OC)c1OC": 891,
            "c1ccccc1)c1ccccc1": 892,
            "Cc1ccc(NC(=O)": 893,
            "c2ccccc2>": 894,
            "c1cccc(Cl)c1": 895,
            "CCC2(": 896,
            "O[C@H]1": 897,
            "CC[C@H]3": 898,
            ")N1CCN(": 899,
            "CCC4": 900,
            "c2cccnc2)": 901,
            "COc1cc2c(cc1": 902,
            "n2)CC1": 903,
            "I)": 904,
            "c(=O)o": 905,
            "CCCCCC": 906,
            "C1=N": 907,
            "Nc1ccc(": 908,
            "cnc2": 909,
            "CCCCCCCCCCCCCCCC": 910,
            "s3)": 911,
            "[n+]2": 912,
            "CC[C@]3(C)": 913,
            "C2CCN(": 914,
            ">c1ccccc1": 915,
            "c2ccco2)": 916,
            "c4ccccc34)": 917,
            "c1[nH]": 918,
            "1C": 919,
            "C5": 920,
            "Cc1ccc2c(c1)": 921,
            "c1cccc2cccc": 922,
            "C(F)(F)F)c1": 923,
            "CCCC2)": 924,
            "CC[C@]1": 925,
            "Cc3ccccc3": 926,
            "c2ccc(Br)cc": 927,
            "c2ccc(NC(=O)": 928,
            "c2cccc(C(F)(F)F)": 929,
            "C(=O)N[C@@H](CC(=O)O)": 930,
            "c4[nH]": 931,
            "c2ccccc2Cl)": 932,
            "C(=O)N[C@@H](CCC(N)=O)": 933,
            "CN(C)C(=O)": 934,
            "N2C(=O)": 935,
            "N(C(=O)": 936,
            "C3CC3)": 937,
            "c1cccc(F)": 938,
            "n1cn": 939,
            "NC(=O)[C@@H]1CCCN1": 940,
            "c2cccs2)": 941,
            "c4ccc(Cl)cc": 942,
            "o2)cc1": 943,
            "[C@@H]6": 944,
            "c2ccccn2)": 945,
            "c3ccc(OC)": 946,
            "C(=O)NCC(=O)N[C@@H](": 947,
            "(CC)": 948,
            "OC[C@H]1": 949,
            "CCN(C)C)": 950,
            "OCO2": 951,
            "c3nn": 952,
            "CCN3": 953,
            "c2C)": 954,
            "NC(=O)[C@@H]2": 955,
            "[C@]2(C)": 956,
            "CSS": 957,
            "c1cccs1": 958,
            "CCC(O)": 959,
            "Cn1cc(": 960,
            "c2cc(F)cc": 961,
            "c1ccc(F)cc1)": 962,
            "c2ccc(C(F)(F)F)cc": 963,
            "3)c1": 964,
            "c2cccc(>": 965,
            "c3c(C)": 966,
            "S(=O)(=O)O)": 967,
            "c2no": 968,
            "n2c(": 969,
            "CCC[C@H](": 970,
            "C=O)": 971,
            "Cc1ccc(O": 972,
            "Cn1c(=O)": 973,
            "CC1=C(": 974,
            "C(=O)N[C@H]1": 975,
            "NC(=O)[C@H](CC(=O)O)": 976,
            "c1ccc2[nH]": 977,
            "c(=O)[nH]c1=O": 978,
            "c3cccnc3)": 979,
            "NCC": 980,
            "[C@@H](OC(=O)": 981,
            "C(=O)N[C@@H](CC(N)=O)": 982,
            "O[C@@H]3": 983,
            "nc21": 984,
            "[C@@H](N)": 985,
            "nc4": 986,
            "c1cs": 987,
            "c3nc(": 988,
            "c(C#N)": 989,
            "sc1": 990,
            "C2)c1": 991,
            "c(F)c1": 992,
            "c2ccc(S(=O)(=O)N": 993,
            "c3ccc(Cl)cc3": 994,
            "Oc1ccc(": 995,
            "4)cc3": 996,
            "NC(=O)[C@H](CCC(=O)O)": 997,
            "c1ccco1": 998,
            "[C@@H](CO)": 999,
            "Cc1ccc(Cl)cc1": 1000,
            "O[C@@H]2": 1001,
            "(C(=O)O)": 1002,
            "CC[C@@H]2": 1003,
            "[C@H](O)[C@H](O)": 1004,
            "NC(=O)[C@H](CCC(N)=O)": 1005,
            "c3s": 1006,
            "CCOCC4)": 1007,
            "CC[C@@]2": 1008,
            "cs1)": 1009,
            "C[C@]12": 1010,
            "cn3)": 1011,
            "c1ccccn1": 1012,
            "[C@@H](C)CC)": 1013,
            "COc1cc(>": 1014,
            "C(=O)c1ccccc1": 1015,
            "c2ccccc2n1": 1016,
            "c3=O)": 1017,
            "c1ncn2": 1018,
            "c5c(": 1019,
            "CC[C@@H]4": 1020,
            "O[C@H]2": 1021,
            "Cn1cn": 1022,
            "c2ccccc2F)": 1023,
            "Cc1cc(>": 1024,
            "CCOC(=O)C1": 1025,
            "c(=O)n1": 1026,
            "n4)": 1027,
            "c1nnc(": 1028,
            "cc(OC)": 1029,
            "NC(=S)N": 1030,
            "CCC(=O)": 1031,
            "[C@@]3(C)": 1032,
            "COc1ccc(NC(=O)": 1033,
            "O[C@@H]1": 1034,
            "CC1(": 1035,
            "CC[C@]4": 1036,
            "c3ncc": 1037,
            "C[C@]": 1038,
            "c3ccncc3)": 1039,
            "C(c2ccccc2)": 1040,
            "c2cccc3cccc": 1041,
            "CCCC1)": 1042,
            "c2ccc([N+](=O)[O-]": 1043,
            "COc1cc(OC)": 1044,
            "c3cccs3)": 1045,
            "c3cc4c(": 1046,
            "c2nnn": 1047,
            "Cc1no": 1048,
            "=[N+]": 1049,
            "c2ccc(C(=O)N": 1050,
            "c2cccc(Cl)c2)": 1051,
            "O[C@H](CO": 1052,
            "c(N3": 1053,
            ".[Na+].[Na+]": 1054,
            "c2ccncc2)": 1055,
            "c1ccccc1>": 1056,
            "c1cccc2c1": 1057,
            "c2ccccc2)n1": 1058,
            "CC[C@@H]3": 1059,
            "(C3": 1060,
            "o2)": 1061,
            "CC(C)=": 1062,
            "c5ccccc5)": 1063,
            "sc2c1": 1064,
            "c(C(=O)": 1065,
            "CCN1CCN(": 1066,
            "C(=S)": 1067,
            "/C=C/C(=O)": 1068,
            "c2nc3c(": 1069,
            "c(=O)n(C)": 1070,
            "C(=O)Nc1ccc(": 1071,
            "c1c(>": 1072,
            "Cl)cc2": 1073,
            "(C#": 1074,
            "c5)": 1075,
            "N=C(N)N": 1076,
            "NC(=O)CNC(=O)[C@H](": 1077,
            "c1=O)": 1078,
            "/C(=N/": 1079,
            "N)ncn": 1080,
            "c2ccc3c(c2)OCO3)": 1081,
            "[C@H](OC(C)=O)": 1082,
            "O[C@H](CO)[C@@H](O)": 1083,
            "CC[C@]4(C)": 1084,
            "c1ccccc1)N": 1085,
            "c(O)c1": 1086,
            "[C@H](O)[C@@H](O)": 1087,
            "(=O)o": 1088,
            "c2c(F)cc": 1089,
            "CN2CCN(": 1090,
            "c2cc(NC(=O)": 1091,
            "c1ccc(O)cc1": 1092,
            "/C=N/N": 1093,
            "CCCN(C": 1094,
            "c3ccccc32)": 1095,
            "c2ncccc2": 1096,
            "[C@@H](CO": 1097,
            "CCCC)": 1098,
            "c(N2": 1099,
            "CCOCC1)": 1100,
            "CCOCC2)cc1": 1101,
            ")cc3": 1102,
            "c2c(Cl)cc": 1103,
            "c2c3c(": 1104,
            ".[Cl-]": 1105,
            "CC(F)(F)": 1106,
            "c7": 1107,
            "c3cc(>": 1108,
            "Cc1ccc(F)cc1": 1109,
            "c5cc": 1110,
            "c(S": 1111,
            "3)cc2)cc1": 1112,
            "NC(=O)OC(C)(C)C)": 1113,
            "c2nc(C)": 1114,
            "[C@@H](OC(C)=O)": 1115,
            "c2ccc(>c3ccccc3": 1116,
            "CCCN(C(=O)": 1117,
            "c2c1)": 1118,
            ")cc1)": 1119,
            "S(=O)(=O)N1": 1120,
            "c2cc1OC": 1121,
            "c2cc3cccc": 1122,
            "C[C@H](N)": 1123,
            "(C)c1": 1124,
            "c2nnc(>": 1125,
            "C/C=C\\": 1126,
            "c1cc(C)": 1127,
            "cc(C(=O)N": 1128,
            "c(C(F)(F)F)": 1129,
            "NC(=O)[C@H](CC(N)=O)": 1130,
            "C)cc": 1131,
            "c3)cc2": 1132,
            "CCCC[C@H](": 1133,
            "[n+](": 1134,
            "c1cccn": 1135,
            "c3ccc(Br)cc": 1136,
            "/C(C)=C/": 1137,
            "CC#": 1138,
            "CN1CCC(": 1139,
            "c3ccc(C(F)(F)F)cc": 1140,
            "CCN(C)CC": 1141,
            "S)N": 1142,
            "F)cc2": 1143,
            "Cn1cc": 1144,
            "OC3": 1145,
            "=C(C)C)": 1146,
            "O3)": 1147,
            "Cc1cccc(>": 1148,
            "c1ccc(C(=O)N": 1149,
            "CCC[C@@H]1": 1150,
            "(c2ccccc2)": 1151,
            "N1C(=O)": 1152,
            "c2F)": 1153,
            "c3nc4ccccc4": 1154,
            "C(C(=O)N": 1155,
            "c3ccccc23)cc1": 1156,
            "C3)cc": 1157,
            "c3cc(O)": 1158,
            "ccc4": 1159,
            "COc1cccc(>": 1160,
            "n3cn": 1161,
            "c3ccccc32)cc1": 1162,
            "C(=O)N[C@@H](Cc1c[nH]c2ccccc12)": 1163,
            "CN4": 1164,
            "CCN)": 1165,
            "CC(C)O": 1166,
            "CC(C)[C@H](": 1167,
            "c[nH]1)": 1168,
            "cc21": 1169,
            "c3cc(C)": 1170,
            "n2>": 1171,
            "c3c2)": 1172,
            "OCO4)": 1173,
            "3CCCCC3)": 1174,
            "[C@H](OC(=O)": 1175,
            "OC2": 1176,
            "CNS(=O)(=O)": 1177,
            "CC2)CC1": 1178,
            "C(=O)N1CCN(": 1179,
            "C(=O)N1CCC(": 1180,
            ".Cl.Cl": 1181,
            "CCCCNC(=O)": 1182,
            "C(F)F)": 1183,
            "Cc1ccc(C(=O)N": 1184,
            "c1ccc(Cl)c(Cl)": 1185,
            "n2cnc3c(": 1186,
            "c4ccccc43)": 1187,
            "[C@H]3O)": 1188,
            "COc1ccc2c(": 1189,
            "c3cccc(F)": 1190,
            "CC2(": 1191,
            "(CCC)": 1192,
            "OC(C)(C)": 1193,
            "NC(=O)CS": 1194,
            "COc1ccc(C2": 1195,
            "cc1)": 1196,
            "c3ccc(F)cc3": 1197,
            "n2nc(": 1198,
            "CCCC4)": 1199,
            "[C@H]6": 1200,
            "c1cc2cccc": 1201,
            "OCC(O)": 1202,
            "CC3)cc2": 1203,
            "CCC3)": 1204,
            "c(=O)n(": 1205,
            "Cc1ccc(S(=O)(=O)N": 1206,
            "c2ccc(Cl)c(Cl)": 1207,
            "c3c[nH]": 1208,
            ".[I-]": 1209,
            "OC)c1": 1210,
            "C[C@H](C)": 1211,
            "N)cc": 1212,
            "C(=O)OC(C)(C)C)": 1213,
            "c2cc3c(cc2": 1214,
            "nn2)": 1215,
            "c(>c3ccccc3)": 1216,
            "C#C": 1217,
            "c2cc(O": 1218,
            "CC(=O)Nc1ccc(": 1219,
            "[C@@H](C)O": 1220,
            "c3C)": 1221,
            "C(=O)N[C@@H](CCCN=C(N)N)": 1222,
            "3CCCC3)": 1223,
            "co1)": 1224,
            "C/C(=N\\": 1225,
            "C(=O)N[C@@H](C": 1226,
            "c2cc(C(=O)N": 1227,
            "c1ccc(C(F)(F)F)cc1": 1228,
            "Cc1ccc(N": 1229,
            "NC(=O)C1": 1230,
            "n2cc(": 1231,
            "FC(F)(F)": 1232,
            "c2Cl)": 1233,
            "[nH]c(": 1234,
            "c2ncc(": 1235,
            "[S+]([O-])": 1236,
            "=C3": 1237,
            "CCCN3": 1238,
            "CC=": 1239,
            "COc1cc2c(cc1OC)": 1240,
            "c3ccc(C(=O)N": 1241,
            "n12": 1242,
            "CCC(=O)O": 1243,
            "nc2n1": 1244,
            "[C@@H]1C": 1245,
            "CCCC(C)": 1246,
            "c1ccc(OC": 1247,
            "c1ccc(C)cc1": 1248,
            "Cc1o": 1249,
            "CC[C@@H](C)": 1250,
            "c1cc2c(cc1": 1251,
            "3)CC1": 1252,
            "c3cc4c(cc3": 1253,
            "[C@@H]12": 1254,
            "n3cc": 1255,
            "N2CCOCC2)": 1256,
            "c2[nH]1": 1257,
            "c3nc(>": 1258,
            "CO[C@H]1": 1259,
            "c(C": 1260,
            "Cc1ccccc1)N": 1261,
            "C2=": 1262,
            "C/C(=C\\": 1263,
            "CN2C(=O)": 1264,
            "c3ccc(C)cc3)": 1265,
            "c2ccc(C)cc2)": 1266,
            "nc2)": 1267,
            "c3ccc(O)cc3)": 1268,
            "C(F)(F)F)cc(C(F)(F)F)": 1269,
            "COc1ccc(OC)": 1270,
            "Br)cc2": 1271,
            "nc1>": 1272,
            "nc2>": 1273,
            "[C@H](C)[C@@H](O": 1274,
            "CCN4": 1275,
            "OC[C@H]1O[C@@H](": 1276,
            "Cc1cnc[nH]1)": 1277,
            "Cc1c[nH]cn1)": 1278,
            "CCc2c(": 1279,
            "CC[C@]2(C)": 1280,
            "c1cn(": 1281,
            "c3cccc(Cl)c3)": 1282,
            "C[C@H](NC(=O)": 1283,
            "CCCN)": 1284,
            "c32)cc1": 1285,
            "ncc3": 1286,
            "C[C@H]1CN(": 1287,
            "CCOCC3)": 1288,
            "[C@@]2(": 1289,
            "CCC2(CC1)": 1290,
            "c2ccc(Br)cc2)": 1291,
            "OC)cc": 1292,
            "CCCN1C(=O)": 1293,
            "C3CCCCC3)": 1294,
            "c3ccc(N4": 1295,
            "CC[C@@]2(C)": 1296,
            "nn3)": 1297,
            "/C=C/C": 1298,
            "c2C1": 1299,
            "CCOc1cc(": 1300,
            "CS)": 1301,
            "c6cccc": 1302,
            ".O=C(O)C(=O)O": 1303,
            "NC(=O)C": 1304,
            "c4cccn": 1305,
            "O)c(": 1306,
            "c3ccccc3)CC2)": 1307,
            "CCOc1ccccc1": 1308,
            "c2ccc(Cl)cc2Cl)": 1309,
            "c1ncn": 1310,
            "CCC)": 1311,
            "oc2c1": 1312,
            "C(=O)N[C@@H](Cc1ccc(O)cc1)": 1313,
            "[C@H](CO)": 1314,
            "o3)": 1315,
            "/C=C/C(=O)N": 1316,
            "c1nc2c(": 1317,
            "CO[C@@H]1": 1318,
            "COc1ccc(N": 1319,
            ")cc12": 1320,
            "c2cc(S(=O)(=O)N": 1321,
            "cc12": 1322,
            "CCCS": 1323,
            "COc1ccc(C(=O)N": 1324,
            "Nc1ncn": 1325,
            "c1cccc(F)c1": 1326,
            "Br.": 1327,
            "n2C)": 1328,
            "[C@H](O)[C@@H]1O": 1329,
            "Nc1ccccc1": 1330,
            "c2ccc3ccccc3c2)": 1331,
            "c3ccc4ccccc4": 1332,
            "C=C2": 1333,
            "c2nc(N)": 1334,
            "CCc1cc(": 1335,
            "CC(N)": 1336,
            "C(=O)C1": 1337,
            "CCCC3": 1338,
            "CS(=O)(=O)N": 1339,
            "C(N": 1340,
            "/C=N/NC(=O)": 1341,
            "c3cc(F)cc": 1342,
            "C(N)=N": 1343,
            "[C@@](O)(": 1344,
            "[C@H]1CC[C@H]2": 1345,
            "C1CCCCC1)": 1346,
            "c1cc2c(": 1347,
            "[C@]1(": 1348,
            "CCCCC3)": 1349,
            "n1cc": 1350,
            "CC2)n1": 1351,
            "c2ccccc2)cc1)": 1352,
            "on1": 1353,
            "N(C)C(=O)": 1354,
            "cc(C)c(=O)[nH]": 1355,
            "c1ccc(>c2n": 1356,
            "[N+](=O)[O-])c1": 1357,
            "Cc1cn(": 1358,
            "CN2CCC(": 1359,
            "nc(O)": 1360,
            "N1CCC(": 1361,
            "2)cc1)": 1362,
            "NC(=O)c1ccc(": 1363,
            "c1c(Cl)cc": 1364,
            ")N(": 1365,
            "[C@](C)(": 1366,
            "(F)c(": 1367,
            "Cc1cs": 1368,
            "c3cc2": 1369,
            "CC[C@@H]4[C@@]5": 1370,
            "C23": 1371,
            "nn3": 1372,
            "nc3)": 1373,
            "cn3": 1374,
            "[C@]4": 1375,
            "nc2c(": 1376,
            "c1cccc(O": 1377,
            "COC(=O)C1": 1378,
            "SC)": 1379,
            "c2cccc3ccccc23)": 1380,
            "CC(=O)O[C@H]1": 1381,
            "NC(=O)c1ccccc1": 1382,
            "[C@@]4(C)": 1383,
            "CC5)": 1384,
            "c>2": 1385,
            ")cc(>": 1386,
            "C(C)C)cc1": 1387,
            "C(=O)NCC(=O)N": 1388,
            "C2)C1": 1389,
            "CCCC3)": 1390,
            "cc2)c1": 1391,
            "c1cccc(N": 1392,
            "[C@@]23": 1393,
            "c3ccccc3Cl)": 1394,
            "CCCC(=O)N": 1395,
            "[C@H](N)": 1396,
            "CCSC)": 1397,
            "CNC": 1398,
            "NC(=O)[C@H](Cc1ccc(O)cc1)": 1399,
            "c4ccc(F)cc4)": 1400,
            "O=C(Nc1ccc(": 1401,
            "C#N)cc1": 1402,
            "CC[C@]43C)": 1403,
            "c(>c3ccc(": 1404,
            "c2ccc(C(=O)O)": 1405,
            "ncc(": 1406,
            "CC[C@H]4": 1407,
            "c4cccc(": 1408,
            "c(=O)c(C(=O)O)": 1409,
            "C(=O)OCC)": 1410,
            "C[n+]1": 1411,
            "n1cc(": 1412,
            "CCn1c(": 1413,
            "CCCCC2)cc1": 1414,
            "c3c(F)cc": 1415,
            "CCc1ccccc1)": 1416,
            "c2O)": 1417,
            "Cn1c(": 1418,
            "Cc1cc(N": 1419,
            "COC1": 1420,
            "c2ccc(OC": 1421,
            "CC(C)N": 1422,
            "Cc1ccc(C)": 1423,
            "[C@H](Cc1ccccc1)": 1424,
            "c2ccc(OC)cc2)": 1425,
            "[C@@H](C": 1426,
            "O=c1[nH]": 1427,
            "nc2ccccc12": 1428,
            "CCCCC2": 1429,
            "[C@@H]2O)": 1430,
            "c2)C1": 1431,
            "C#N)cc": 1432,
            "c1o": 1433,
            "c1cccc2ccccc12": 1434,
            "c2ccc(Cl)": 1435,
            "Cc1nc(>": 1436,
            "c2ccc3n": 1437,
            "c13)": 1438,
            "(CC(=O)N": 1439,
            "3)C1)": 1440,
            "c1O)": 1441,
            "CC=C": 1442,
            "c1ccc2ccccc2c1": 1443,
            "CCC[C@H]2": 1444,
            "c3ccccc3)cc2": 1445,
            "C(=O)N2CCN(": 1446,
            "COc1ccc(Cl)cc1": 1447,
            "c1N": 1448,
            "[nH]2)": 1449,
            "[C@@]1(O)": 1450,
            "CCC(C)(C)": 1451,
            "NC(=O)CO": 1452,
            "c45)": 1453,
            "C(C)(C)[C@@H]5": 1454,
            "c1cc(F)cc": 1455,
            "CC2)C1": 1456,
            "c2cc(OC)c(OC)c(OC)": 1457,
            "c1ccccc1O": 1458,
            "c34)cc": 1459,
            "c2ccc(F)": 1460,
            "CC[C@]12": 1461,
            "N=C1": 1462,
            "CCc2ccccc2": 1463,
            "Cc1ccc(S(=O)(=O)": 1464,
            "c3ccccc3F)": 1465,
            "C4=O)": 1466,
            "=N)": 1467,
            "c1ncc(": 1468,
            "C(=O)C": 1469,
            "CSCC[C@H](": 1470,
            "c3cccc(C(F)(F)F)": 1471,
            "c2ccncc": 1472,
            "c1ccccc1Cl": 1473,
            "c2ccc(Cl)cc2)cc1": 1474,
            "c1ccc(OC)cc1": 1475,
            "NC(=O)[C@@H]2CCCN2": 1476,
            "nn(>": 1477,
            "c3ccc4c(c3)OCO4)": 1478,
            "/c(": 1479,
            "C(C#N)": 1480,
            "CC(C)(": 1481,
            "OCC(=O)N": 1482,
            "P(=O)(O": 1483,
            "O=S(=O)(N": 1484,
            "[C@@]1(": 1485,
            "ccc(N)": 1486,
            "S2": 1487,
            "o1)": 1488,
            "NC(=O)[C@H](Cc2ccccc2)": 1489,
            "c1cccc(O)": 1490,
            "c2ccs": 1491,
            "C(Cl)": 1492,
            "[C@H]2O": 1493,
            "P(=O)([O-])": 1494,
            ")N2": 1495,
            "[N+](C)(C)": 1496,
            "=C(O)": 1497,
            "OO": 1498,
            "CCC(=O)N1": 1499,
            "c1cc(O)": 1500,
            "CC(NC(=O)": 1501,
            "c1cccnc1)": 1502,
            "c(=O)n3": 1503,
            "CN(C)C)": 1504,
            "c2cccc(O)": 1505,
            "n3)cc": 1506,
            "CC12": 1507,
            "CCN(CC": 1508,
            "[nH]c2c1": 1509,
            "C1CCCC1": 1510,
            "c1c(F)cc": 1511,
            "cnc2c1ncn2": 1512,
            "c1cccc(NC(=O)": 1513,
            "CCCCN(": 1514,
            "COC(=O)N": 1515,
            "c1nnc(>": 1516,
            ">3": 1517,
            "nn2)cc1": 1518,
            "c2ccc3[nH]": 1519,
            "c1cc(N": 1520,
            "CNC(=O)N": 1521,
            "/C=C/C(=O)O": 1522,
            "O=C(CSc1n": 1523,
            "c2ccc([N+](=O)[O-])cc2)": 1524,
            "CCNS(=O)(=O)": 1525,
            "2)n1": 1526,
            "c1ccccc12": 1527,
            "NC(=O)OCc1ccccc1)": 1528,
            "c43)": 1529,
            "CCCCC4)": 1530,
            "OCCCC": 1531,
            "COc1ccc(S(=O)(=O)N": 1532,
            "[C@H]2C": 1533,
            "n4cn": 1534,
            "CC=C(": 1535,
            "c1c2c(": 1536,
            "CCC[C@@H](": 1537,
            "CCC3(": 1538,
            "O=C(NC1": 1539,
            "[C@H]1CC[C@H](": 1540,
            "c3ccc(OC)cc3)": 1541,
            "c3c(>": 1542,
            "c2cccc(C(F)(F)F)c2)": 1543,
            "CC[C@]4(C)[C@H]3": 1544,
            "c4=O)": 1545,
            "Cc1c(>": 1546,
            "c2ccc(F)cc2)CC1": 1547,
            "c2cccc(F)c2)": 1548,
            "c1ccc(>c2cn": 1549,
            "c(S(=O)(=O)N": 1550,
            "Cc1cccc2": 1551,
            "cc2c1": 1552,
            "c1ccccn1)": 1553,
            "CCc2ccccc2)": 1554,
            "c3cccnc3": 1555,
            "c(=O)[nH]1": 1556,
            "CC1CCCCC1)": 1557,
            "c2cccc([N+](=O)[O-])": 1558,
            "c2cc(=O)": 1559,
            "C(C)C)C(C)C)": 1560,
            "S(C)(=O)=O": 1561,
            "nc(N3": 1562,
            "(Cc2ccccc2)": 1563,
            "CC[C@H](O)": 1564,
            "c1nc(C)": 1565,
            "COCCO": 1566,
            "CCCO)": 1567,
            "[n+]([O-])": 1568,
            "c5cc(": 1569,
            "c4ccc(Cl)cc4)": 1570,
            "/N=N/": 1571,
            "c4ccccc4)cc3)": 1572,
            "Cc2ccccc2)CC1": 1573,
            "c2ccc(Cl)cc2)CC1": 1574,
            "C(=O)c2ccccc2": 1575,
            "C/C=C/": 1576,
            "C(O)C(O)": 1577,
            "COC(": 1578,
            "NC(=O)[C@H](Cc1c[nH]c2ccccc12)": 1579,
            "Oc2ccc(": 1580,
            "N#Cc1ccc(": 1581,
            "COc1c(": 1582,
            "4)C2)": 1583,
            "C1O": 1584,
            "CC3CC(CC(C": 1585,
            "[C@](C)(O)": 1586,
            "[nH]1)": 1587,
            "nc2ccccc21": 1588,
            "c2cccc(C)": 1589,
            "S(=O)(=O)[O-])": 1590,
            "c2cc(N": 1591,
            "C3)cc1": 1592,
            "c3ccc(Br)cc3)": 1593,
            "CCn1cc(": 1594,
            "CC(=O)OC": 1595,
            "ccc(>": 1596,
            "c2cc(Cl)ccc2": 1597,
            "c2ccc(F)cc2)cc1": 1598,
            ">c1ccc(": 1599,
            "[C@H](C)CO)": 1600,
            "OC[C@H]3": 1601,
            "CC(N": 1602,
            "COc1ccc(C(=O)": 1603,
            "c3ccc(N": 1604,
            "N2CCC(": 1605,
            "C(=O)O)cc": 1606,
            "CC3CC(CC(C3)C1)": 1607,
            "CCCCn1": 1608,
            "COc1cccc2": 1609,
            "CN(C)S(=O)(=O)": 1610,
            "Cn1cc(>": 1611,
            "CC2CC2)": 1612,
            "CC(C(=O)N": 1613,
            "c2c(F)cccc2": 1614,
            "c6ccccc6": 1615,
            "COC(=O)c1ccc(": 1616,
            "CC1=": 1617,
            ".O=C(O)C(F)(F)F.O=C(O)C(F)(F)F": 1618,
            "/C1=C\\": 1619,
            "C2=O)c1": 1620,
            "[N+]1": 1621,
            "c2cc(Br)cc": 1622,
            "c2C)cc1": 1623,
            "c3ccc(Cl)c(Cl)": 1624,
            "c(N)n": 1625,
            "NC(=O)[C@H](CCCN=C(N)N)": 1626,
            "c3cccc(F)c3)": 1627,
            "CCNCC3)": 1628,
            "C3=": 1629,
            "c1ccc(>n2": 1630,
            "n2C": 1631,
            "OCCCO": 1632,
            "CC3)cc1": 1633,
            "C(=O)O1": 1634,
            "c1ccco1)": 1635,
            "C[C@@H](O": 1636,
            "CCN(S(=O)(=O)": 1637,
            "N)cc1": 1638,
            "c2n[nH]": 1639,
            "N5": 1640,
            "c4ccncc": 1641,
            "c1ncccc1": 1642,
            "C4CC4)": 1643,
            "N2CCN(C(=O)": 1644,
            "C2CCCC2)": 1645,
            "[C@@](C)(O)": 1646,
            "nc(S": 1647,
            "[C@H]1C": 1648,
            "nc(NC(=O)": 1649,
            "S)=N": 1650,
            "ccc12": 1651,
            "c4c3": 1652,
            "[C@H]12": 1653,
            "CCCN(C)C)": 1654,
            "c2c1=O": 1655,
            "c(O)c(": 1656,
            "[C@@H]7": 1657,
            "c1no": 1658,
            "[C@]23": 1659,
            "c1ccc2c(c1)OCO2": 1660,
            "/C=C1\\": 1661,
            "Cn2cn": 1662,
            "C(=O)N[C@@H](Cc2ccccc2)": 1663,
            "c1cccc(C(F)(F)F)c1": 1664,
            "c1cccc(C": 1665,
            "c4ccccc4)CC3)": 1666,
            "c3ccc(C(F)(F)F)cc3)": 1667,
            "n1>c1ccccc1": 1668,
            "n5": 1669,
            "c2cccc(O": 1670,
            "OCc1ccccc1": 1671,
            "Cc1cc(C)cc(": 1672,
            "CCC2)": 1673,
            "n(>c2ccccc2)": 1674,
            "ncn1": 1675,
            "c2nc(>c3ccccc3)": 1676,
            "C3=N": 1677,
            "c1nc(N)": 1678,
            "c2cc(OC)": 1679,
            "c3c(Cl)cc": 1680,
            "C[C@@H]4": 1681,
            "C(O)(": 1682,
            "S(=O)(=O)c1ccccc1": 1683,
            "nc1)": 1684,
            "CC2=O)": 1685,
            "NC(=O)c1cc(": 1686,
            "CCCl)": 1687,
            "4)cc2": 1688,
            "n2c1": 1689,
            "CC(C)(O)": 1690,
            "COc1cc(N": 1691,
            "c2cccnc2": 1692,
            "c2ccccc2c1)": 1693,
            "C3=C(": 1694,
            "CN(C)c1ccc(": 1695,
            "CCc3ccccc3": 1696,
            "C(=O)OCC": 1697,
            "c4ccc(O)cc": 1698,
            "c2cc(N3": 1699,
            "c4ccc(>": 1700,
            "=C1/": 1701,
            "O=C1c2ccccc2": 1702,
            "Cc1[nH]": 1703,
            "ccn1": 1704,
            "C3(": 1705,
            "N[C@H](": 1706,
            "CC2)ccc1": 1707,
            "NC(=O)/C=C/": 1708,
            "C2CC3": 1709,
            "c3ccc(F)": 1710,
            "c4ccco": 1711,
            "c4cc5": 1712,
            "c3cccc4cccc": 1713,
            "COC": 1714,
            "CCCCCCN": 1715,
            "c2ccc(O)cc2": 1716,
            "=[N-]": 1717,
            "C)c1": 1718,
            "CC[C@@]4": 1719,
            "4C)": 1720,
            "c1cccc2ccccc12)": 1721,
            "c2cncc": 1722,
            "nc1N": 1723,
            "COc1ccccc1>": 1724,
            "CC1=N": 1725,
            "[C@H](C)[C@@H](O)": 1726,
            "O=C(O": 1727,
            "[Si](C)": 1728,
            "[nH]3)": 1729,
            "C[C@H]4": 1730,
            "[C@@](C)": 1731,
            "CCNCC1": 1732,
